### ADVANCED PANDAS

In [56]:
import pandas as pd

In [57]:
import numpy as np

In [58]:
df=pd.read_excel("Documents/weather1.xlsx")

In [59]:
df

         DAY  TEMPARATURE  WINDSPEED   EVEN
0 2017-01-01           32          6   Rain
1 2017-01-02       -99999          7  Sunny
2 2017-01-03           28     -99999   Snow
3 2017-01-04       -99999          7      0
4 2017-01-05           32     -99999   Rain
5 2017-01-06           31          2  Sunny
6 2017-01-06           34          5      0
7 2017-01-07           38          7   Rain

In [60]:
df.shape

(8, 4)

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   DAY          8 non-null      datetime64[ns]
 1   TEMPARATURE  8 non-null      int64
 2   WINDSPEED    8 non-null      int64
 3   EVEN         8 non-null      object
dtypes: datetime64[ns](1), int64(2), object(1)
memory usage: 384.0+ bytes

### Replacing a nan value

In [62]:
df.replace(-99999,value=np.NaN,inplace=True)

In [63]:
df

         DAY  TEMPARATURE  WINDSPEED   EVEN
0 2017-01-01         32.0        6.0   Rain
1 2017-01-02          NaN        7.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN        7.0      0
4 2017-01-05         32.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0      0
7 2017-01-07         38.0        7.0   Rain

### Replaceing list of values with a value

In [64]:
df.replace([32.0,7.0],value=99,inplace=True)

In [65]:
df

         DAY  TEMPARATURE  WINDSPEED   EVEN
0 2017-01-01         99.0        6.0   Rain
1 2017-01-02          NaN       99.0  Sunny
2 2017-01-03         28.0        NaN   Snow
3 2017-01-04          NaN       99.0      0
4 2017-01-05         99.0        NaN   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0      0
7 2017-01-07         38.0       99.0   Rain

### Replaceing per column

In [66]:
df=df.replace({'TEMPARATURE':99,"WINDSPEED":np.NaN},100)

In [67]:
df

         DAY  TEMPARATURE  WINDSPEED   EVEN
0 2017-01-01        100.0        6.0   Rain
1 2017-01-02          NaN       99.0  Sunny
2 2017-01-03         28.0      100.0   Snow
3 2017-01-04          NaN       99.0      0
4 2017-01-05        100.0      100.0   Rain
5 2017-01-06         31.0        2.0  Sunny
6 2017-01-06         34.0        5.0      0
7 2017-01-07         38.0       99.0   Rain

### Replaceing all columns with another value

In [68]:
df=df.replace([6.0,99.0,100.0,99.0,100.0,2.0,5.0,99.0],['6 kms','99 kms','100 kms','99 kms','100 kms','2 kms','5 kms','99 kms'])

In [69]:
df

         DAY TEMPARATURE WINDSPEED   EVEN
0 2017-01-01     100 kms     6 kms   Rain
1 2017-01-02         NaN    99 kms  Sunny
2 2017-01-03        28.0   100 kms   Snow
3 2017-01-04         NaN    99 kms      0
4 2017-01-05     100 kms   100 kms   Rain
5 2017-01-06        31.0     2 kms  Sunny
6 2017-01-06        34.0     5 kms      0
7 2017-01-07        38.0    99 kms   Rain

### Remove mph from windspeed & F from Temperature

In [70]:
df=df.replace({'TEMPARATURE':'[A-Za-z]','WINDSPEED':'[A-Za-z]'},' ', regex=True)

In [71]:
df

         DAY TEMPARATURE WINDSPEED   EVEN
0 2017-01-01     100         6       Rain
1 2017-01-02         NaN    99      Sunny
2 2017-01-03        28.0   100       Snow
3 2017-01-04         NaN    99          0
4 2017-01-05     100       100       Rain
5 2017-01-06        31.0     2      Sunny
6 2017-01-06        34.0     5          0
7 2017-01-07        38.0    99       Rain

### Replaceing using mapping

In [72]:
df=df.replace({np.NaN:69,0:'Sunny'})

In [73]:
df

         DAY TEMPARATURE WINDSPEED   EVEN
0 2017-01-01     100         6       Rain
1 2017-01-02          69    99      Sunny
2 2017-01-03        28.0   100       Snow
3 2017-01-04          69    99      Sunny
4 2017-01-05     100       100       Rain
5 2017-01-06        31.0     2      Sunny
6 2017-01-06        34.0     5      Sunny
7 2017-01-07        38.0    99       Rain

# project Advanced data cleaning using Pandas

In [74]:
import pandas as pd

In [75]:
import numpy as np

In [76]:
data=pd.read_csv("Melbourne_housing_FULL.csv")
OriData=data

In [77]:
data.shape

(34857, 21)

In [78]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34857 entries, 0 to 34856
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Suburb         34857 non-null  object
 1   Address        34857 non-null  object
 2   Rooms          34857 non-null  int64
 3   Type           34857 non-null  object
 4   Price          27247 non-null  float64
 5   Method         34857 non-null  object
 6   SellerG        34857 non-null  object
 7   Date           34857 non-null  object
 8   Distance       34856 non-null  float64
 9   Postcode       34856 non-null  float64
 10  Bedroom2       26640 non-null  float64
 11  Bathroom       26631 non-null  float64
 12  Car            26129 non-null  float64
 13  Landsize       23047 non-null  float64
 14  BuildingArea   13742 non-null  float64
 15  YearBuilt      15551 non-null  float64
 16  CouncilArea    34854 non-null  object
 17  Lattitude      26881 non-null  float64
 18  Longtitude     26881 non-null  float64
 19  Regionname     34854 non-null  object
 20  Propertycount  34854 non-null  float64
dtypes: float64(12), int64(1), object(8)
memory usage: 5.6+ MB

In [79]:
data.head()

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,Abbotsford,68 Studley St,2,h,NaN,SS,Jellis,3/09/2016,2.5,3067.0,...,1.0,1.0,126.0,NaN,NaN,Yarra City Council,-37.8014,144.9958,Northern Metropolitan,4019.0
1,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,3067.0,...,1.0,1.0,202.0,NaN,NaN,Yarra City Council,-37.7996,144.9984,Northern Metropolitan,4019.0
2,Abbotsford,25 Bloomburg St,2,h,1035000.0,S,Biggin,4/02/2016,2.5,3067.0,...,1.0,0.0,156.0,79.0,1900.0,Yarra City Council,-37.8079,144.9934,Northern Metropolitan,4019.0
3,Abbotsford,18/659 Victoria St,3,u,NaN,VB,Rounds,4/02/2016,2.5,3067.0,...,2.0,1.0,0.0,NaN,NaN,Yarra City Council,-37.8114,145.0116,Northern Metropolitan,4019.0
4,Abbotsford,5 Charles St,3,h,1465000.0,SP,Biggin,4/03/2017,2.5,3067.0,...,2.0,0.0,134.0,150.0,1900.0,Yarra City Council,-37.8093,144.9944,Northern Metropolitan,4019.0

In [80]:
data.isnull().sum(axis=0).sort_values(ascending=False)

BuildingArea     21115
YearBuilt        19306
Landsize         11810
Car               8728
Bathroom          8226
Bedroom2          8217
Longtitude        7976
Lattitude         7976
Price             7610
Regionname           3
CouncilArea          3
Propertycount        3
Postcode             1
Distance             1
Address              0
Date                 0
SellerG              0
Method               0
Type                 0
Rooms                0
Suburb               0
dtype: int64

In [81]:
data.isnull().sum(axis=1).sort_values(ascending=False)

29483    13
18523    11
26888    11
32125     9
11231     9
         ..
24737     0
24738     0
9437      0
9435      0
34856     0
Length: 34857, dtype: int64

In [82]:
data.isnull().sum()>0

Suburb           False
Address          False
Rooms            False
Type             False
Price             True
Method           False
SellerG          False
Date             False
Distance          True
Postcode          True
Bedroom2          True
Bathroom          True
Car               True
Landsize          True
BuildingArea      True
YearBuilt         True
CouncilArea       True
Lattitude         True
Longtitude        True
Regionname        True
Propertycount     True
dtype: bool

In [83]:
data.isnull().any(axis=0).sort_values(ascending=False)

Bedroom2          True
Bathroom          True
Regionname        True
Longtitude        True
Lattitude         True
CouncilArea       True
YearBuilt         True
BuildingArea      True
Landsize          True
Car               True
Propertycount     True
Postcode          True
Distance          True
Price             True
Address          False
Date             False
SellerG          False
Method           False
Type             False
Rooms            False
Suburb           False
dtype: bool

In [84]:
data.isnull().any().sort_values(ascending=False)

Bedroom2          True
Bathroom          True
Regionname        True
Longtitude        True
Lattitude         True
CouncilArea       True
YearBuilt         True
BuildingArea      True
Landsize          True
Car               True
Propertycount     True
Postcode          True
Distance          True
Price             True
Address          False
Date             False
SellerG          False
Method           False
Type             False
Rooms            False
Suburb           False
dtype: bool

In [85]:
data.isnull().any().index[data.isnull().any().values]

Index(['Price', 'Distance', 'Postcode', 'Bedroom2', 'Bathroom', 'Car',
       'Landsize', 'BuildingArea', 'YearBuilt', 'CouncilArea', 'Lattitude',
       'Longtitude', 'Regionname', 'Propertycount'],
      dtype='object')

In [86]:
data[data.isnull().any(axis=1)]

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,...,Bathroom,Car,Landsize,BuildingArea,YearBuilt,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
0,Abbotsford,68 Studley St,2,h,NaN,SS,Jellis,3/09/2016,2.5,3067.0,...,1.0,1.0,126.0,NaN,NaN,Yarra City Council,-37.80140,144.99580,Northern Metropolitan,4019.0
1,Abbotsford,85 Turner St,2,h,1480000.0,S,Biggin,3/12/2016,2.5,3067.0,...,1.0,1.0,202.0,NaN,NaN,Yarra City Council,-37.79960,144.99840,Northern Metropolitan,4019.0
3,Abbotsford,18/659 Victoria St,3,u,NaN,VB,Rounds,4/02/2016,2.5,3067.0,...,2.0,1.0,0.0,NaN,NaN,Yarra City Council,-37.81140,145.01160,Northern Metropolitan,4019.0
5,Abbotsford,40 Federation La,3,h,850000.0,PI,Biggin,4/03/2017,2.5,3067.0,...,2.0,1.0,94.0,NaN,NaN,Yarra City Council,-37.79690,144.99690,Northern Metropolitan,4019.0
7,Abbotsford,16 Maugie St,4,h,NaN,SN,Nelson,6/08/2016,2.5,3067.0,...,2.0,2.0,400.0,220.0,2006.0,Yarra City Council,-37.79650,144.99650,Northern Metropolitan,4019.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
34848,Wollert,16 Gunther Wy,4,h,621000.0,S,hockingstuart,24/02/2018,25.5,3750.0,...,2.0,2.0,375.0,NaN,NaN,Whittlesea City Council,-37.61331,145.03412,Northern Metropolitan,2940.0
34850,Wollert,15 Rockgarden Wy,3,h,NaN,SP,LJ,24/02/2018,25.5,3750.0,...,2.0,2.0,268.0,135.0,2016.0,Whittlesea City Council,-37.61094,145.04281,Northern Metropolitan,2940.0
34851,Yarraville,78 Bayview Rd,3,h,1101000.0,S,Jas,24/02/2018,6.3,3013.0,...,1.0,NaN,288.0,NaN,NaN,Maribyrnong City Council,-37.81095,144.88516,Western Metropolitan,6543.0
34852,Yarraville,13 Burns St,4,h,1480000.0,PI,Jas,24/02/2018,6.3,3013.0,...,1.0,3.0,593.0,NaN,NaN,Maribyrnong City Council,-37.81053,144.88467,Western Metropolitan,6543.0
34855,Yarraville,12/37 Stephen St,3,h,1140000.0,SP,hockingstuart,24/02/2018,6.3,3013.0,...,NaN,NaN,NaN,NaN,NaN,Maribyrnong City Council,NaN,NaN,Western Metropolitan,6543.0

In [87]:
data.isnull().all(axis=0)

Suburb           False
Address          False
Rooms            False
Type             False
Price            False
Method           False
SellerG          False
Date             False
Distance         False
Postcode         False
Bedroom2         False
Bathroom         False
Car              False
Landsize         False
BuildingArea     False
YearBuilt        False
CouncilArea      False
Lattitude        False
Longtitude       False
Regionname       False
Propertycount    False
dtype: bool

In [88]:
print("rows having all null values : {}".format(data.isnull().all(axis=1).sum()))
print("columns having all null values : {}".format(data.isnull().all(axis=0).sum()))

rows having all null values : 0
columns having all null values : 0

In [89]:
(((data.isnull().sum(axis=0)).sort_values(ascending=False)/len(data))*100).round(2)

BuildingArea     60.58
YearBuilt        55.39
Landsize         33.88
Car              25.04
Bathroom         23.60
Bedroom2         23.57
Longtitude       22.88
Lattitude        22.88
Price            21.83
Regionname        0.01
CouncilArea       0.01
Propertycount     0.01
Postcode          0.00
Distance          0.00
Address           0.00
Date              0.00
SellerG           0.00
Method            0.00
Type              0.00
Rooms             0.00
Suburb            0.00
dtype: float64

In [90]:
col=(data.isnull().sum(axis=0)).sort_values(ascending=False).head(3).index.values

In [91]:
col

array(['BuildingArea', 'YearBuilt', 'Landsize'], dtype=object)

In [92]:
data.drop(col,axis=1,inplace=True)

In [93]:
(((data.isnull().sum(axis=0)).sort_values(ascending=False))*100/len(data)).round(2)

Car              25.04
Bathroom         23.60
Bedroom2         23.57
Longtitude       22.88
Lattitude        22.88
Price            21.83
Propertycount     0.01
Regionname        0.01
CouncilArea       0.01
Postcode          0.00
Distance          0.00
Address           0.00
Date              0.00
SellerG           0.00
Method            0.00
Type              0.00
Rooms             0.00
Suburb            0.00
dtype: float64

In [94]:
data[data.isnull().sum(axis=1)>5]

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Distance,Postcode,Bedroom2,Bathroom,Car,CouncilArea,Lattitude,Longtitude,Regionname,Propertycount
34,Abbotsford,16b Mollison St,2,h,NaN,PI,Biggin,16/07/2016,2.5,3067.0,NaN,NaN,NaN,Yarra City Council,NaN,NaN,Northern Metropolitan,4019.0
60,Abbotsford,4/328 Johnston St,2,u,NaN,PI,Biggin,28/05/2016,2.5,3067.0,NaN,NaN,NaN,Yarra City Council,NaN,NaN,Northern Metropolitan,4019.0
121,Airport West,2/89 Marshall Rd,3,u,NaN,VB,Barry,25/02/2017,13.5,3042.0,NaN,NaN,NaN,Moonee Valley City Council,NaN,NaN,Western Metropolitan,3464.0
207,Alphington,4/5 Chandler Hwy,4,t,NaN,PN,Nelson,13/08/2016,6.4,3078.0,NaN,NaN,NaN,Darebin City Council,NaN,NaN,Northern Metropolitan,2211.0
211,Alphington,11 Tower Av,4,h,NaN,S,Jellis,16/04/2016,6.4,3078.0,NaN,NaN,NaN,Darebin City Council,NaN,NaN,Northern Metropolitan,2211.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
34769,Surrey Hills,1/4 Wells St,2,u,NaN,SP,Jellis,24/02/2018,10.2,3127.0,NaN,NaN,NaN,Boroondara City Council,NaN,NaN,Southern Metropolitan,5457.0
34779,Templestowe Lower,11/231 High St,3,u,NaN,SN,Woodards,24/02/2018,12.4,3107.0,NaN,NaN,NaN,Manningham City Council,NaN,NaN,Eastern Metropolitan,5420.0
34792,Thornbury,83/337 Station St,2,u,NaN,S,Nelson,24/02/2018,7.0,3071.0,NaN,NaN,NaN,Darebin City Council,NaN,NaN,Northern Metropolitan,8870.0
34813,Wantirna South,11/61 Cathies La,4,t,NaN,W,Harcourts,24/02/2018,14.7,3152.0,NaN,NaN,NaN,Knox City Council,NaN,NaN,Eastern Metropolitan,7082.0
34829,West Melbourne,9/11 Anderson St,3,u,NaN,S,hockingstuart,24/02/2018,3.1,3003.0,NaN,NaN,NaN,Melbourne City Council,NaN,NaN,Northern Metropolitan,2230.0

In [95]:
len(data[data.isnull().sum(axis=1)>5])

1721

In [96]:
round(((len(data[data.isnull().sum(axis=1)>5])/len(data))*100),2)

4.94

In [97]:
((data.isnull().sum().sort_values(ascending=False)/len(data))*100).round(2)

Car              25.04
Bathroom         23.60
Bedroom2         23.57
Longtitude       22.88
Lattitude        22.88
Price            21.83
Propertycount     0.01
Regionname        0.01
CouncilArea       0.01
Postcode          0.00
Distance          0.00
Address           0.00
Date              0.00
SellerG           0.00
Method            0.00
Type              0.00
Rooms             0.00
Suburb            0.00
dtype: float64

In [98]:
data=data[data['Price'].notnull()]

In [99]:
data.Price.isnull().sum()

0

In [100]:
round(data.isnull().sum().sort_values(ascending=False)/len(data)*100,2)

Car              25.04
Bathroom         23.66
Bedroom2         23.64
Longtitude       22.95
Lattitude        22.95
Propertycount     0.01
Regionname        0.01
CouncilArea       0.01
Postcode          0.00
Distance          0.00
Address           0.00
Date              0.00
SellerG           0.00
Method            0.00
Price             0.00
Type              0.00
Rooms             0.00
Suburb            0.00
dtype: float64

In [101]:
data['Car'].describe()

count    20423.000000
mean         1.715370
std          0.994216
min          0.000000
25%          1.000000
50%          2.000000
75%          2.000000
max         18.000000
Name: Car, dtype: float64

In [102]:
data=data[data.Car.notnull()]

In [103]:
round(data.isnull().sum().sort_values(ascending=False)/len(data)*100,2)

Longtitude       0.11
Lattitude        0.11
Suburb           0.00
Address          0.00
Regionname       0.00
CouncilArea      0.00
Car              0.00
Bathroom         0.00
Bedroom2         0.00
Postcode         0.00
Distance         0.00
Date             0.00
SellerG          0.00
Method           0.00
Price            0.00
Type             0.00
Rooms            0.00
Propertycount    0.00
dtype: float64

In [106]:
data.loc[:,['Longtitude','Lattitude']].describe()

         Longtitude     Lattitude
count  20401.000000  20401.000000
mean     144.997212    -37.806842
std        0.120885      0.092208
min      144.423790    -38.190430
25%      144.924900    -37.861300
50%      145.004500    -37.799800
75%      145.069500    -37.748000
max      145.526350    -37.397800

In [108]:
data['Lattitude'].mean()

-37.80684190676945

In [110]:
data['Lattitude']=data['Lattitude'].fillna(data['Lattitude'].mean())

In [111]:
data['Lattitude']

1       -37.79960
2       -37.80790
4       -37.80930
5       -37.79690
6       -37.80720
           ...
34849   -37.61031
34852   -37.81053
34853   -37.81551
34854   -37.82286
34856   -37.81810
Name: Lattitude, Length: 20423, dtype: float64

In [112]:
data['Longtitude'].mean()

144.99721196362933

In [113]:
data['Longtitude']=data['Longtitude'].fillna(data['Longtitude'].mean())

In [114]:
round(data.isnull().sum().sort_values(ascending=False)/len(data)*100,2)

Suburb           0.0
Address          0.0
Regionname       0.0
Longtitude       0.0
Lattitude        0.0
CouncilArea      0.0
Car              0.0
Bathroom         0.0
Bedroom2         0.0
Postcode         0.0
Distance         0.0
Date             0.0
SellerG          0.0
Method           0.0
Price            0.0
Type             0.0
Rooms            0.0
Propertycount    0.0
dtype: float64

In [117]:
X=data.drop('Price',axis=1)
y=data['Price']

In [118]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.33,random_state=42)